cmsis-svd/cmsis-svd/data/Atmel/ATSAME70J21.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378H</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x400E1890</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>ICM</name>
         <version>11105F</version>
         <description>Integrity Check Monitor</description>
         <groupName>ICM</groupName>
         <prependToName>ICM_</prependToName>
         <baseAddress>0x40048000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x58</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ICM</name>
            <value>32</value>
         </interrupt>
         <registers>
            <register>
               <name>ICM_CFG</name>
               <description>Configuration Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WBDIS</name>
                     <description>Write Back Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOMDIS</name>
                     <description>End of Monitoring Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLBDIS</name>
                     <description>Secondary List Branching Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBC</name>
                     <description>Bus Burden Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ASCD</name>
                     <description>Automatic Switch To Compare Digest</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUALBUFF</name>
                     <description>Dual Input Buffer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIHASH</name>
                     <description>User Initial Hash Value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UALGO</name>
                     <description>User SHA Algorithm</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>UALGOSelect</name>
                        <enumeratedValue>
                           <name>SHA1</name>
                           <description>SHA1 algorithm processed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA256</name>
                           <description>SHA256 algorithm processed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA224</name>
                           <description>SHA224 algorithm processed</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_CTRL</name>
               <description>Control Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ICM Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISABLE</name>
                     <description>ICM Disable Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REHASH</name>
                     <description>Recompute Internal Hash</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RMDIS</name>
                     <description>Region Monitoring Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RMEN</name>
                     <description>Region Monitoring Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_SR</name>
               <description>Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ICM Controller Enable Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAWRMDIS</name>
                     <description>Region Monitoring Disabled Raw Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RMDIS</name>
                     <description>Region Monitoring Disabled Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RHC</name>
                     <description>Region Hash Completed Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RDM</name>
                     <description>Region Digest Mismatch Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RBE</name>
                     <description>Region Bus Error Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RWC</name>
                     <description>Region Wrap Condition detected Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Region End bit Condition Detected Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RSU</name>
                     <description>Region Status Updated Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Undefined Register Access Detection Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RHC</name>
                     <description>Region Hash Completed Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RDM</name>
                     <description>Region Digest Mismatch Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RBE</name>
                     <description>Region Bus Error Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RWC</name>
                     <description>Region Wrap Condition Detected Interrupt Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Region End bit Condition detected Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RSU</name>
                     <description>Region Status Updated Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Undefined Register Access Detection Interrupt Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RHC</name>
                     <description>Region Hash Completed Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RDM</name>
                     <description>Region Digest Mismatch Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RBE</name>
                     <description>Region Bus Error Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RWC</name>
                     <description>Region Wrap Condition Detected Interrupt Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Region End bit Condition Detected Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RSU</name>
                     <description>Region Status Updated Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Undefined Register Access Detection Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RHC</name>
                     <description>Region Hash Completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RDM</name>
                     <description>Region Digest Mismatch</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RBE</name>
                     <description>Region Bus Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RWC</name>
                     <description>Region Wrap Condition Detected</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Region End bit Condition Detected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RSU</name>
                     <description>Region Status Updated Detected</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Undefined Register Access Detection Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_UASR</name>
               <description>Undefined Access Status Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>URAT</name>
                     <description>Undefined Register Access Trace</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>URATSelect</name>
                        <enumeratedValue>
                           <name>UNSPEC_STRUCT_MEMBER</name>
                           <description>Unspecified structure member set to one detected when the descriptor is loaded.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICM_CFG_MODIFIED</name>
                           <description>ICM_CFG modified during active monitoring.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICM_DSCR_MODIFIED</name>
                           <description>ICM_DSCR modified during active monitoring.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICM_HASH_MODIFIED</name>
                           <description>ICM_HASH modified during active monitoring</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READ_ACCESS</name>
                           <description>Write-only register read access</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_DSCR</name>
               <description>Region Descriptor Area Start Address Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DASA</name>
                     <description>Descriptor Area Start Address</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICM_HASH</name>
               <description>Region Hash Area Start Address Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HASA</name>
                     <description>Hash Area Start Address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>25</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICM_UIHVAL[%s]</name>
               <description>User Initial Hash Value 0 Register 0</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>Initial Hash Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
